<details ><summary>apply for 01-terraform-infra_envs_dev_data 2026-02-27 17:07:44 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS myapp"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "dev-myapp-rds-"
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-021744c76a22f8bdc"
    }

  # module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "dev-myapp subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "dev-myapp-"
      + region                  = "eu-central-1"
      + subnet_ids              = [
          + "subnet-0064320542a476f70",
          + "subnet-05c79cb66256c5a08",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "dev-myapp"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "dev-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "myapp"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "dev-myapp"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "eu-central-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "dev"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "dev-myapp parameter group"
      + family       = "postgres16"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "dev-myapp-"
      + region       = "eu-central-1"
      + skip_destroy = false
      + tags         = {
          + "Name" = "dev-myapp"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "Name"        = "dev-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_instance_address                = (known after apply)
  + db_instance_endpoint               = (known after apply)
  + db_instance_master_user_secret_arn = (known after apply)
  + db_instance_name                   = "myapp"
  + db_instance_port                   = 5432
  + db_instance_username               = (sensitive value)
  + db_security_group_id               = (known after apply)
module.db_subnet_group.aws_db_subnet_group.this[0]: Creating...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creating...
aws_security_group.rds: Creating...
module.db_subnet_group.aws_db_subnet_group.this[0]: Creation complete after 1s [id=dev-myapp-20260227170826776000000002]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creation complete after 1s [id=dev-myapp-20260227170826776000000001]
aws_security_group.rds: Creation complete after 4s [id=sg-00437d862f5e8f913]
module.db.module.db_instance.aws_db_instance.this[0]: Creating...
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [2m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [3m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [4m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [5m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [6m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [7m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m0s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m10s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m20s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m30s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m40s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Still creating... [8m50s elapsed]
module.db.module.db_instance.aws_db_instance.this[0]: Creation complete after 8m55s [id=db-JO6PEV4L3UECFJWCID5RJG3KHY]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

db_instance_address = "dev-myapp.c9c62oam0utb.eu-central-1.rds.amazonaws.com"
db_instance_endpoint = "dev-myapp.c9c62oam0utb.eu-central-1.rds.amazonaws.com:5432"
db_instance_master_user_secret_arn = "arn:aws:secretsmanager:eu-central-1:188494185951:secret:rds!db-0bc2ddff-3137-43ee-a1dc-32f9a5e86f89-k0hloN"
db_instance_name = "myapp"
db_instance_port = 5432
db_instance_username = <sensitive>
db_security_group_id = "sg-00437d862f5e8f913"

```
</details>
</details>